742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "cmsis_os.h"

/* USER CODE BEGIN Includes */
#include "taskApp.h"
#include "delay.h"
#include "user_call_back.h"
#include "wireless_app.h"
#include "wireless_drv.h"
#include "uart.h"
#include "stmflash.h"
#include "led.h"
#include "frame_process.h"
#include "stm32f0_eeprom.h"
#include "aes.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
void StartDefaultTask(void const *argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint8_t uart1_rec;
uint8_t uart2_rec;

//根据家庭组切换到新的固定通讯频道上
#ifdef Use_Rx_Hop
void Get_WireLessChannel(uint8_t *wire_chnel)
{
    uint32_t temp_val = LANGroup_Addr[0] + LANGroup_Addr[1] + LANGroup_Addr[2];

    //uint32_t temp_val = 0x00 + 0x29 + 0x02;
    //uint32_t temp_val = 0x00 + 0x2A + 0x5B;
    if (temp_val == 0)
    {
        wire_chnel[0] = Default_Channel;
        wire_chnel[1] = Default_Channel;
    }
    else
    {
        wire_chnel[0] = (temp_val & 0x1f) << 1; //共32个信道组，每个信道组有两个信道
        wire_chnel[1] = wire_chnel[0] + 1;
        if (wire_chnel[0] == Default_Channel)
        {
            wire_chnel[0] = wire_chnel[0] + 2;
            wire_chnel[1] = wire_chnel[0] + 1;
        }
    }

    RF_RX_HOP_CONTROL_12[7] = Channel_Frequency_Index[wire_chnel[0]]; //放入群组的主频道
    RF_RX_HOP_CONTROL_12[8] = Channel_Frequency_Index[wire_chnel[1]]; //放入群组的备用频道
}
#else
void Get_WireLessChannel(uint8_t *wire_chnel)
{
    wire_chnel[0] = Default_Channel;
    wire_chnel[1] = Default_Channel;
}
#endif

//扩展板版本号应答                                     
void FrameCmdVersionAck(FRAME_CMD_t *frameCmd)
{
	FRAME_CMD_t frameAck;
	uint8_t frameLen;
	

	memcpy((uint8_t*)&frameAck, (uint8_t*)frameCmd, 16);
	frameAck.addr_DA = 0xFF;
	frameAck.addr_GA[0] = 0xFF;
	frameAck.addr_GA[1] = 0xFF;
	frameAck.addr_GA[2] = 0xFF;
	frameAck.Ctrl.dir = 1;	
	frameAck.DataLen = 6;
	frameAck.userData.content[0]= Version_Number >> 8;
	frameAck.userData.content[1]= Version_Number & 0xff;
	
	frameLen = Frame_Compose((uint8_t *)&frameAck);
	vTaskSuspendAll(); //开启任务调度锁
    UartSendBytes(USART1, (uint8_t *)&frameAck, frameLen);
    xTaskResumeAll(); //关闭任务调度锁
}

//扩展板自身应答给安卓板
void FrameCmdLocalAck(FRAME_CMD_t *frameCmd)
{
    FRAME_CMD_t frameAck;
	uint8_t frameLen;
	
	memcpy((uint8_t*)&frameAck, (uint8_t*)frameCmd, 16);
	frameAck.addr_DA = 0xFF;
	frameAck.addr_GA[0] = 0xFF;
	frameAck.addr_GA[1] = 0xFF;
	frameAck.addr_GA[2] = 0xFF;
	frameAck.Ctrl.dir = 1;	
	frameAck.DataLen = 0;
	
	frameLen = Frame_Compose((uint8_t *)&frameAck);
	vTaskSuspendAll(); //开启任务调度锁
    UartSendBytes(USART1, (uint8_t *)&frameAck, frameLen);
    xTaskResumeAll(); //关闭任务调度锁
}

extern osThreadId LedTaskHandle;
extern void MacFrame_Process(uint8_t *p_source, uint8_t *p_buf);
extern uint8_t SecretKey_Process(DeviceInfo_t *p_deviceInfo);

//本地命令处理
void Local_CmdProcess(FRAME_CMD_t *frameCmd)
{

