742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/Src/main.c
    uint8_t indexType = frameCmd->userData.Index[0];
    uint16_t indexCmd = (frameCmd->userData.Index[1] << 8) + frameCmd->userData.Index[2];
	WRITE_AES_CMD_t *p_write_cmd = (WRITE_AES_CMD_t*)frameCmd->userData.content;

    switch (indexType)
    {
    case 0xFF:           //初始化数据
        switch (indexCmd)
        {
		case 0x0001:		//读软件版本号
			FrameCmdVersionAck(frameCmd);			
		break;
        case 0xFF00:		//写群组地址和密钥
			memcpy(deviceInfo.addr_GA,p_write_cmd->addr_GA,3);
			memcpy(deviceInfo.aes,p_write_cmd->aes,16);
			STMFLASH_Write(DEVICE_INFO_BASH_ADDR,(uint16_t*)&deviceInfo,(sizeof(deviceInfo)+1)/2);		//+1和/2是为了2字节对齐
			SecretKey_Process(&deviceInfo);          //计算出密文，存放在aes_w，供加解密用
            FrameCmdLocalAck(frameCmd);	
            break;
		default:
			FrameCmdLocalAck(frameCmd);
			break;
        }
        break;
    case 0x00:
        break;
    case 0x01:
        switch (indexCmd)
        {
        case 0x0021:
            xTaskNotify(LedTaskHandle, frameCmd->userData.content[0], eSetValueWithOverwrite);
            FrameCmdLocalAck(frameCmd);
            break;
		default:
			FrameCmdLocalAck(frameCmd);
			break;
		
        }
        break;
    case 0x02:
        break;
    case 0x03:
        break;
    case 0x04:
        break;
    default:
		FrameCmdLocalAck(frameCmd);
        break;
    }
}


//串口接收处理
void UartRx_Process(UpCom_Rx_TypDef *prx_ubuf, DevicePara_TypDef *p_device)
{
    FRAME_CMD_t *frameCmd;
	uint8_t send_len;
    frameCmd = (FRAME_CMD_t *)prx_ubuf->Frame_Data;
	

    if (prx_ubuf->Rx_Status == UartRx_Finished)
    {
        if (0 == FrameData_Detect(prx_ubuf->Frame_Data, prx_ubuf->FrameTotalLen))
        {
			if(frameCmd->FameHead == HKFreamHeader)
			{
				if(frameCmd->Ctrl.dir == 0)					//主站（安卓版）下行数据
				{
					if(frameCmd->Ctrl.relayFlag == 0)	//本地（发给扩展板）
					{
						if(frameCmd->Ctrl.eventFlag == 0) //命令
						{
							Local_CmdProcess(frameCmd);
						}
						else  if(frameCmd->Ctrl.eventFlag == 1)		//事件(应答)
						{

						}

					}
					else if(frameCmd->Ctrl.relayFlag == 1)	//转发（发给电器设备）
					{
						if(frameCmd->Ctrl.eventFlag == 0) //命令
						{
							FrameCmdLocalAck(frameCmd);
							if(frameCmd->FSQ.encryptType)  //加密
							{
								send_len = Encrypt_Convert((uint8_t*)frameCmd, frameCmd->DataLen+11, 0); 
							}
							else						//不加密
							{
								send_len = frameCmd->DataLen+11;
							}
							Si4438_Transmit_Start(&Wireless_Buf, Default_Channel, (uint8_t*)frameCmd, send_len);       //串口数据无线转发
						}
						else  if(frameCmd->Ctrl.eventFlag == 1)		//事件(应答)
						{

						}
						
					}
				}
			}
			else if(frameCmd->FameHead == AESFreamHeader)		//烧录MAC地址
			{

				MacFrame_Process(prx_ubuf->Frame_Data,HKFrame_Buf.FrameProcess_Buf);
				memcpy(deviceInfo.mac,Local_MAC_Addr +3,8);
				deviceInfo.mac_exist = 1;
				STMFLASH_Write(DEVICE_INFO_BASH_ADDR,(uint16_t*)&deviceInfo,(sizeof(deviceInfo)+1)/2);
			}
        }

        prx_ubuf->Rx_Status = UartRx_FrameHead;
    }
}


extern osThreadId UartTaskHandle;

void WireLess_Process(WLS *p_wl, DevicePara_TypDef *p_device)
{
    static uint8_t Wireless_ErrCnt = 0;
	uint8_t out_len;
	uint8_t frame_type;

    if (WIRELESS_STATUS == Wireless_RX_Finish) //Receive Finish
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;
       
		
		#ifdef Use_74dcode
		//74解码
		if (((p_wl->Wireless_RxData[Region_CmdNumber] & 0X07) != 0X07) && ((p_wl->Wireless_RxData[Region_CmdNumber] & 0X07) != 0X02)) //带编码能力的电器回复无cmd标识
		{
			FrameData_74Convert((FRAME_CMD_t*)p_wl->Wireless_RxData,p_wl->Wireless_PacketLength,&out_len,0);
			p_wl->Wireless_PacketLength = out_len;
		}
		#endif
			
		//校验帧头和CRC16	
        if (0 == FrameData_Detect(p_wl->Wireless_RxData, p_wl->Wireless_PacketLength))
        {
            frame_type = p_wl->Wireless_RxData[Region_CmdNumber] & 0x98;
            p_device->Pending_Flag &= 0x0f;

            if (frame_type == RemoteDown_CmdFrame)
            {
				xTaskNotify(UartTaskHandle,0x10<<8, eSetValueWithOverwrite);
            }
            else if (frame_type == RemoteDown_EventFrame)
            {
				xTaskNotify(UartTaskHandle, 0x20<<8, eSetValueWithOverwrite);
            }
            else
			{
                Si4438_Receive_Start(Wireless_Channel[0]);
			}
        }
		else
		{
			Si4438_Receive_Start(Wireless_Channel[0]);
		} 
		if (WIRELESS_STATUS == Wireless_Free)	
		{			
			Si4438_Receive_Start(Wireless_Channel[0]);
		}
    }
    else if (WIRELESS_ERROR_CODE == Wireless_CmdResponseError)
    {
        WIRELESS_ERROR_CODE = Wireless_NoError;
        /*Si4438_Receive_Start(Wireless_Channel[0]);   //Start Receive*/
        if (++Wireless_ErrCnt > 10)
            WIRELESS_ERROR_CODE = Wireless_InitError;
    }

    if (WIRELESS_ERROR_CODE == Wireless_ExecuteError) //Channel Busy
    {
        WIRELESS_STATUS = Wireless_Free;

        Si4438_Receive_Start(Wireless_Channel[0]); //Start Receive
    }

    if (WIRELESS_STATUS == Wireless_TX_Finish)
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;
        //LEDR_INVERSE();
        Si4438_Receive_Start(Wireless_Channel[0]); //Start Receive
    }

    else if (WIRELESS_STATUS == Wireless_RX_Failure)
    {
        WIRELESS_STATUS = Wireless_Free;
        Wireless_ErrCnt = 0;
        Res_FifoInfo(RESET_RECEIVE);
        //Si4438_Receive_Start(Wireless_Channel[0]);         //Start Receive
    }    
}

void System_8msTick_Process(void)
{
    if ((WIRELESS_STATUS == Wireless_RX_Receiving) && (!!NIRQ_RDPIN() == 0))
    {
        Si4438_Receive_Start(Wireless_Channel[0]); //Restart Receive
    }
    if (WIRELESS_ERROR_CODE == Wireless_Busy) //Channel Busy
    {
        if (Wireless_Buf.Channel_Busy_cnt) // Send Ready
        {
            if (++Wireless_Buf.Channel_Busy_cnt > BUSY_TIMEOUT)
            {
                Wireless_Buf.Channel_Busy_cnt = 0;

                //Set_Property(Interrupt_Close);
                WIRELESS_ERROR_CODE = Wireless_NoError;
                Si4438_Receive_Start(Wireless_Channel[0]);
            }
        }
        else
            WIRELESS_ERROR_CODE = Wireless_NoError;
    }
    if (WirelessRx_Timeout_Cnt)
    {
        if (++WirelessRx_Timeout_Cnt > WirelessRx_Timeout_Threshold)
        {
            WirelessRx_Timeout_Cnt = 0;

