742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/Src/main.c
            Si4438_Receive_Start(Wireless_Channel[0]);
        }
    }
    if (Wireless_Buf.Sent_TimeOut_Cnt > 0)
    {
        if (++Wireless_Buf.Sent_TimeOut_Cnt > WLSent_TimeOut_Val)
        {
            Wireless_Buf.Sent_TimeOut_Cnt = 0;
            WIRELESS_STATUS = Wireless_TX_Finish;
        }
    }
    if (UpCom_TxBuf.Tx_Status == UartTx_End)
    {
        if (++UpCom_TxBuf.TxEnd_Cnt > Tx_GapTime_Size)
        {
            UpCom_TxBuf.TxEnd_Cnt = 0;
            UpCom_TxBuf.Tx_Status = UartTx_Finished;
        }
    }
    if (UpCom_RxBuf.Over_time_count)
    {
        if (++UpCom_RxBuf.Over_time_count > Up_TimeOut_Val)
        {
            UpCom_RxBuf.Over_time_count = 0;
            UpCom_RxBuf.Rx_Status = UartRx_FrameHead;
        }
    }
#ifdef Use_Rout
    if (Frame_Wait_Cnt)
    {
        Frame_Wait_Cnt++;
    }
#endif
}

void MacFrame_Process(uint8_t *p_source, uint8_t *p_buf)
{
    uint16_t crc16_val;

    if (p_source[1] == MACWrite_Cmd_Request)
    {
        if (memcmp(Local_MAC_Addr, p_source, MAC_Data_Len + 5) != 0) //只能烧一次
        {
			STMFLASH_Write(MAC_EAddr, (uint16_t *)p_source, (MAC_Data_Len + 5+1)/2);
            STMFLASH_Read(MAC_EAddr, (uint16_t *)Local_MAC_Addr, (MAC_Data_Len + 5+1)/2);
            if (memcmp(Local_MAC_Addr, p_source, MAC_Data_Len + 5) == 0)
            {
                p_buf[1] = MACWrite_Yes_Response;
                p_buf[3] = 0xff;
            }
            else
            {
                p_buf[1] = MACWrite_NO_Response;
                p_buf[3] = 0x00;
            }
        }
        else
        {
            p_buf[1] = MACWrite_Yes_Response;
            p_buf[3] = 0xff;
        }
        p_buf[0] = AESFreamHeader;
        p_buf[2] = 1;
        crc16_val = CRC16_2(p_buf, 4);
        p_buf[4] = crc16_val >> 8;
        p_buf[5] = crc16_val & 0xff;

        UpUart_DataTx(p_buf, 6, &UpCom_TxBuf);
    }
}

uint8_t Remain_series;


void MacAddr_Read(void)
{
    uint32_t delay_cnt = 0;
    do
    {
        SysDelay_Xms(20);

        UartRx_Process(&UpCom_RxBuf, &Device_ParaBuf);
        Eeprom_Read(MAC_EAddr, (uint16_t *)Local_MAC_Addr, MAC_Data_Len + 5);
        delay_cnt++;
        if (delay_cnt > 50)
        {
            delay_cnt = 0;
            //DEBUG_Printf("Please input Mac Frame\r\n");
            UartSendData(USART1, 0x0C);
        }
    } while (0 != FrameData_Detect(Local_MAC_Addr, MAC_Data_Len + 5));
	
}

void Aes_Key_Read(void)
{
    Eeprom_Read(KEY_StartAddr, (uint16_t *)aes_out, AesBuf_Size / 2);
    Secret_GKey_Flag = 1;
    memset(&aes_out[RsaByte_Size * 2], 0, 19); 
}

void LANGroup_AddrRead(void)
{
    uint8_t temp[4] = {0};
    Eeprom_Read(GD_ADDR, (uint16_t *)temp, 4 / 2);
    memcpy(LANGroup_Addr, temp, 3);
}

//密文初始化
void AES_Init(void)
{
    //计算出密文，存放在aes_w，供加解密用
    memcpy(&aes_out[3 * RsaByte_Size], LANGroup_Addr, 3);

    Rsa_Decode(aes_out);
    key_expansion(aes_out, aes_w);
    Secret_KeyOk_Flag = 1;
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{

    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration----------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */
    delay_init(72);
    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_SPI1_Init();
    MX_TIM1_Init();
    /* USER CODE BEGIN 2 */

    HAL_TIM_Base_Start_IT(&htim1);
    HAL_UART_Receive_IT(&huart1, &uart1_rec, 1);
    HAL_UART_Receive_IT(&huart2, &uart2_rec, 1);
    SN3218_Init();
    //PowerOn_Led();
    MacAddr_Read();
    Aes_Key_Read();
	STMFLASH_Read(DEVICE_INFO_BASH_ADDR,(uint16_t *)&deviceInfo,(sizeof(deviceInfo)+1)/2);   //读出设备信息
	memcpy(deviceInfo.mac,Local_MAC_Addr +3,8);
	SecretKey_Process(&deviceInfo);          //计算出密文，存放在aes_w，供加解密用

    Get_WireLessChannel(Wireless_Channel);
    Wireless_Init();
    Si4438_Receive_Start(Wireless_Channel[0]);

    /* USER CODE END 2 */

    /* USER CODE BEGIN RTOS_MUTEX */
    /* add mutexes, ... */
    /* USER CODE END RTOS_MUTEX */

    /* USER CODE BEGIN RTOS_SEMAPHORES */
    /* add semaphores, ... */
    /* USER CODE END RTOS_SEMAPHORES */

    /* USER CODE BEGIN RTOS_TIMERS */
    /* start timers, add new ones, ... */
    /* USER CODE END RTOS_TIMERS */

    /* Create the thread(s) */
    /* definition and creation of defaultTask */

    /* USER CODE BEGIN RTOS_THREADS */
    AppTaskCreate();
    /* add threads, ... */
    /* USER CODE END RTOS_THREADS */

    /* USER CODE BEGIN RTOS_QUEUES */
    /* add queues, ... */
    /* USER CODE END RTOS_QUEUES */

    /* Start scheduler */
    osKernelStart();

    /* We should never get here as control is now taken by the scheduler */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    //  	I2C_Start();
    //	I2C_Write1Byte(SN3218_ADDR);
    //	I2C_Write1Byte(0x01);
    //	I2C_Write1Byte(0x02);
    //	I2C_Write1Byte(64);
    //	I2C_Stop();
    //
    //	Write_SN3218(Addr_DataRefresh, 0x55);
    //	delay_ms(1000);
    //	SN3218_Led_Clear1();
    while (1)
    {

        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */
    }

    /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        _Error_Handler(__FILE__, __LINE__);
    }

